In [1]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [2]:
df=pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  0.026748  0.153742 -1.548483 -0.109088
B -2.735318 -1.476121  0.403760  0.595034
C  0.608582 -0.081660 -0.726936 -0.012464
D  0.112726 -0.743432  0.339842  0.012941
E -0.108837 -1.552744 -0.164013  0.558693

In [3]:
df['W']

A    0.026748
B   -2.735318
C    0.608582
D    0.112726
E   -0.108837
Name: W, dtype: float64

In [4]:
df[['W','Z']]

          W         Z
A  0.026748 -0.109088
B -2.735318  0.595034
C  0.608582 -0.012464
D  0.112726  0.012941
E -0.108837  0.558693

In [5]:

type(df['W'])

pandas.core.series.Series

In [6]:
df['new']=df['W']+df['Y']

In [7]:
df

          W         X         Y         Z       new
A  0.026748  0.153742 -1.548483 -0.109088 -1.521736
B -2.735318 -1.476121  0.403760  0.595034 -2.331559
C  0.608582 -0.081660 -0.726936 -0.012464 -0.118354
D  0.112726 -0.743432  0.339842  0.012941  0.452568
E -0.108837 -1.552744 -0.164013  0.558693 -0.272850

In [8]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.026748  0.153742 -1.548483 -0.109088
B -2.735318 -1.476121  0.403760  0.595034
C  0.608582 -0.081660 -0.726936 -0.012464
D  0.112726 -0.743432  0.339842  0.012941
E -0.108837 -1.552744 -0.164013  0.558693

In [9]:
df.drop('E',axis=0)

          W         X         Y         Z       new
A  0.026748  0.153742 -1.548483 -0.109088 -1.521736
B -2.735318 -1.476121  0.403760  0.595034 -2.331559
C  0.608582 -0.081660 -0.726936 -0.012464 -0.118354
D  0.112726 -0.743432  0.339842  0.012941  0.452568

In [10]:
df.loc['A']

W      0.026748
X      0.153742
Y     -1.548483
Z     -0.109088
new   -1.521736
Name: A, dtype: float64

In [11]:
df.loc['B','Y']

0.403759746766644

In [12]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.026748 -1.548483
B -2.735318  0.403760

In [13]:
#an important featuren of pandas conditional selecting using braket notation,very similar to numpy:
    
df

          W         X         Y         Z       new
A  0.026748  0.153742 -1.548483 -0.109088 -1.521736
B -2.735318 -1.476121  0.403760  0.595034 -2.331559
C  0.608582 -0.081660 -0.726936 -0.012464 -0.118354
D  0.112726 -0.743432  0.339842  0.012941  0.452568
E -0.108837 -1.552744 -0.164013  0.558693 -0.272850

In [14]:
df>0

       W      X      Y      Z    new
A   True   True  False  False  False
B  False  False   True   True  False
C   True  False  False  False  False
D   True  False   True   True   True
E  False  False  False   True  False

In [15]:
df[df>0]

          W         X         Y         Z       new
A  0.026748  0.153742       NaN       NaN       NaN
B       NaN       NaN  0.403760  0.595034       NaN
C  0.608582       NaN       NaN       NaN       NaN
D  0.112726       NaN  0.339842  0.012941  0.452568
E       NaN       NaN       NaN  0.558693       NaN

In [16]:
df[df['W']>2]

Empty DataFrame
Columns: [W, X, Y, Z, new]
Index: []

In [17]:
df[df['W']>2]

Empty DataFrame
Columns: [W, X, Y, Z, new]
Index: []

In [18]:
df[df['W']>0]['Y']

A   -1.548483
C   -0.726936
D    0.339842
Name: Y, dtype: float64

In [19]:
df[df['W']>0][['Y','X']]

          Y         X
A -1.548483  0.153742
C -0.726936 -0.081660
D  0.339842 -0.743432

In [20]:
df[(df['W']>0)&(df['Y']>1)]

Empty DataFrame
Columns: [W, X, Y, Z, new]
Index: []

In [21]:
df

          W         X         Y         Z       new
A  0.026748  0.153742 -1.548483 -0.109088 -1.521736
B -2.735318 -1.476121  0.403760  0.595034 -2.331559
C  0.608582 -0.081660 -0.726936 -0.012464 -0.118354
D  0.112726 -0.743432  0.339842  0.012941  0.452568
E -0.108837 -1.552744 -0.164013  0.558693 -0.272850

In [22]:
df.reset_index()

  index         W         X         Y         Z       new
0     A  0.026748  0.153742 -1.548483 -0.109088 -1.521736
1     B -2.735318 -1.476121  0.403760  0.595034 -2.331559
2     C  0.608582 -0.081660 -0.726936 -0.012464 -0.118354
3     D  0.112726 -0.743432  0.339842  0.012941  0.452568
4     E -0.108837 -1.552744 -0.164013  0.558693 -0.272850

In [23]:
newid='CA NY WY OR CO'.split()
df['States']=newid
df

          W         X         Y         Z       new States
A  0.026748  0.153742 -1.548483 -0.109088 -1.521736     CA
B -2.735318 -1.476121  0.403760  0.595034 -2.331559     NY
C  0.608582 -0.081660 -0.726936 -0.012464 -0.118354     WY
D  0.112726 -0.743432  0.339842  0.012941  0.452568     OR
E -0.108837 -1.552744 -0.164013  0.558693 -0.272850     CO

In [24]:
df.set_index('States',inplace=True)
df

               W         X         Y         Z       new
States
CA      0.026748  0.153742 -1.548483 -0.109088 -1.521736
NY     -2.735318 -1.476121  0.403760  0.595034 -2.331559
WY      0.608582 -0.081660 -0.726936 -0.012464 -0.118354
OR      0.112726 -0.743432  0.339842  0.012941  0.452568
CO     -0.108837 -1.552744 -0.164013  0.558693 -0.272850

In [25]:

#index levels
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [26]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [27]:
df=pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -0.303983  0.581513
   2  0.906342 -1.038670
   3 -0.779359 -0.424238
G2 1  2.309688  0.514361
   2  0.378100 -2.513422
   3 -0.041091 -0.051499

In [28]:

df.loc['G1']

          A         B
1 -0.303983  0.581513
2  0.906342 -1.038670
3 -0.779359 -0.424238

In [29]:

df.loc['G1'].loc[1]

A   -0.303983
B    0.581513
Name: 1, dtype: float64

In [30]:
df.index.names

FrozenList([None, None])

In [31]:
df.index.names

FrozenList([None, None])

In [32]:
df.index.names=['Group','Num']
df

                  A         B
Group Num
G1    1   -0.303983  0.581513
      2    0.906342 -1.038670
      3   -0.779359 -0.424238
G2    1    2.309688  0.514361
      2    0.378100 -2.513422
      3   -0.041091 -0.051499

In [33]:

df.xs('G1')

            A         B
Num
1   -0.303983  0.581513
2    0.906342 -1.038670
3   -0.779359 -0.424238

In [34]:
df.xs(['G1',1])

C:\Users\afsal\AppData\Local\Temp\ipykernel_20760\580597333.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['G1',1])

A   -0.303983
B    0.581513
Name: (G1, 1), dtype: float64

In [35]:
df.xs(1,level='Num')

              A         B
Group
G1    -0.303983  0.581513
G2     2.309688  0.514361

In [36]:
labels=['a','b','c']
my_list=[10,20,30]
arr=np.array([10,20,30])
d={'a':10,'b':20,'c':30}

In [37]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [38]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [39]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [40]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [41]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [42]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [43]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [44]:
ser1=pd.Series([1,2,3,4],index=['USA','Germany','USSR','japan'])
ser1

USA        1
Germany    2
USSR       3
japan      4
dtype: int64

In [50]:
ser2=pd.Series([1,2,3,5],index=['USA','Germany','italy','japan'])
ser2

USA        1
Germany    2
italy      3
japan      5
dtype: int64

In [51]:
ser1['USA']

1

In [52]:
ser1+ser2

Germany    4.0
USA        2.0
USSR       NaN
italy      NaN
japan      9.0
dtype: float64

In [53]:
df=pd.DataFrame({'A':[1,2,np.nan],
                'B':[5,np.nan,np.nan],
                'C':[1,2,3]})

In [54]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [55]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [57]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [58]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [59]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [60]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [61]:
data={'company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
     'Person':['Sam','charlie','amy','venessa','carl','sarah'],
     'sales':[200,120,340,124,243,350]}
df=pd.DataFrame(data)
df

  company   Person  sales
0    GOOG      Sam    200
1    GOOG  charlie    120
2    MSFT      amy    340
3    MSFT  venessa    124
4      FB     carl    243
5      FB    sarah    350

In [62]:
df.groupby('company')

In [63]:
by_comp=df.groupby('company')
by_comp

In [64]:
by_comp.mean()

         sales
company
FB       296.5
GOOG     160.0
MSFT     232.0

In [65]:
df.groupby('company').mean()

         sales
company
FB       296.5
GOOG     160.0
MSFT     232.0

In [66]:
by_comp.std()

              sales
company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [67]:
by_comp.min()

        Person  sales
company
FB        carl    243
GOOG       Sam    120
MSFT       amy    124

In [68]:
by_comp.max()

          Person  sales
company
FB         sarah    350
GOOG     charlie    200
MSFT     venessa    340

In [69]:
by_comp.count()

         Person  sales
company
FB            2      2
GOOG          2      2
MSFT          2      2

In [70]:
by_comp.describe()

        sales
        count   mean         std    min     25%    50%     75%    max
company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [72]:
by_comp.describe().transpose()

company              FB        GOOG        MSFT
sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [73]:
by_comp.describe().transpose()['GOOG']

sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [74]:

df=pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [76]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [77]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [78]:
newdf=df[(df['col1']>2)&(df['col2']==444)]
newdf

   col1  col2 col3
3     4   444  xyz

In [79]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [80]:
df['col1'].sum()

10

In [81]:
del df['col1']

In [82]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [83]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [84]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [85]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [86]:
df.sort_values(by='col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [87]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [88]:
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [89]:
df=pd.DataFrame({'col1':[1,2,3,np.nan],
                'col2':[np.nan,555,666,444],
                'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [90]:
df.fillna('FILL')

   col1   col2 col3
0   1.0   FILL  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3  FILL  444.0  xyz

In [91]:
data={'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
     'C':['x','y','x','y','x','y'],
     'D':[1,3,2,5,4,1]}
df=pd.DataFrame(data)

In [92]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1